myinit.el

;; [[file:~/.emacs.d/myinit.org::*IBUFFER][IBUFFER:1]]
(global-set-key (kbd "C-x C-b") 'ibuffer)
(setq ibuffer-saved-filter-groups
      (quote (("default"
               ("dired" (mode . dired-mode))
               ("org" (name . "^.*org$"))
               ("magit" (mode . magit-mode))
               ("IRC" (or (mode . circe-channel-mode) (mode . circe-server-mode)))
               ("web" (or (mode . web-mode) (mode . js2-mode)))
               ("shell" (or (mode . eshell-mode) (mode . shell-mode)))
               ("mu4e" (or

                        (mode . mu4e-compose-mode)
                        (name . "\*mu4e\*")
                        ))
               ("programming" (or
                               (mode . clojure-mode)
                               (mode . clojurescript-mode)
                               (mode . python-mode)
                               (mode . c++-mode)))
               ("emacs" (or
                         (name . "^\\*scratch\\*$")
                         (name . "^\\*Messages\\*$")))
               ))))
(add-hook 'ibuffer-mode-hook
          (lambda ()
            (ibuffer-auto-mode 1)
            (ibuffer-switch-to-saved-filter-groups "default")))

;; don't show these
                                        ;(add-to-list 'ibuffer-never-show-predicates "zowie")
;; Don't show filter groups if there are no buffers in that group
(setq ibuffer-show-empty-filter-groups nil)

;; Don't ask for confirmation to delete marked buffers
(setq ibuffer-expert t)
;; IBUFFER:1 ends here

;; [[file:~/.emacs.d/myinit.org::*personal keymap][personal keymap:1]]
;; set up my own map
(define-prefix-command 'z-map)
(global-set-key (kbd "C-z") 'z-map) ;; was C-1
(define-key z-map (kbd "k") 'compile)
(define-key z-map (kbd "c") 'hydra-multiple-cursors/body)
(define-key z-map (kbd "m") 'mu4e)
(define-key z-map (kbd "1") 'org-global-cycle)
(define-key z-map (kbd "a") 'org-agenda-show-agenda-and-todo)
(define-key z-map (kbd "g") 'counsel-ag)
(define-key z-map (kbd "2") 'make-frame-command)
(define-key z-map (kbd "0") 'delete-frame)
(define-key z-map (kbd "o") 'ace-window)

(define-key z-map (kbd "s") 'flyspell-correct-word-before-point)
(define-key z-map (kbd "i") 'z/load-iorg)
(define-key z-map (kbd "f") 'origami-toggle-node)
(define-key z-map (kbd "w") 'z/swap-windows)
(define-key z-map (kbd "*") 'calc)


  (setq user-full-name "Nishadh Singh"
                          user-mail-address "nishadhsingh@gmail.com")
  ;;--------------------------------------------------------------------------


  (global-set-key (kbd "\e\ei")
                  (lambda () (interactive) (find-file "~/org/orgfiles/i.org")))

  (global-set-key (kbd "\e\el")
                  (lambda () (interactive) (find-file "~/org/orgfiles/links.org")))

  (global-set-key (kbd "\e\ec")
                  (lambda () (interactive) (find-file "~/.emacs.d/myinit.org")))

(global-set-key (kbd "<end>") 'move-end-of-line)

(global-set-key [mouse-3] 'flyspell-correct-word-before-point)
;; personal keymap:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Wgrep][Wgrep:1]]
(use-package wgrep
:ensure t
)
(use-package wgrep-ag
:ensure t
)
(require 'wgrep-ag)
;; Wgrep:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Silversearcher][Silversearcher:1]]
(use-package ag
:ensure t)
;; Silversearcher:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Regex][Regex:1]]
(use-package pcre2el
:ensure t
:config 
(pcre-mode)
)
;; Regex:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Eyebrowse][Eyebrowse:2]]
(use-package pdf-tools
:ensure t)
(use-package org-pdfview
:ensure t)

(require 'pdf-tools)
(require 'org-pdfview)
;; Eyebrowse:2 ends here

;; [[file:~/.emacs.d/myinit.org::*auto-yasnippet][auto-yasnippet:1]]
(use-package auto-yasnippet
:ensure t)
;; auto-yasnippet:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Word stuff][Word stuff:1]]
(use-package dictionary
  :ensure t)

(use-package synosaurus
  :ensure t)
;; Word stuff:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Ripgrep][Ripgrep:1]]
(use-package deadgrep 
:ensure t)

(use-package rg
:ensure t
:commands rg)
;; Ripgrep:1 ends here

;; [[file:~/.emacs.d/myinit.org::*Fzf][Fzf:1]]
(use-package fzf :ensure t)
;; Fzf:1 ends here

;; [[file:~/.emacs.d/myinit.org::*dashbord , spaceline,themes][dashbord , spaceline,themes:1]]
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook))
(setq dashboard-banner-logo-title "Welcome to Emacs Dashboard")
;; Set the banner
;;(setq dashboard-startup-banner 3)
(setq dashboard-startup-banner "~/khan-academy-aqualine-seed-logo.png")
;; Value can be
;; 'official which displays the official emacs logo
;; 'logo which displays an alternative emacs logo
;; 1, 2 or 3 which displays one of the text banners
;; "path/to/your/image.png" which displays whatever image you would prefer

;; Content is not centered by default. To center, set
(setq dashboard-center-content t)

;; To disable shortcut "jump" indicators for each section, set
(setq dashboard-show-shortcuts t)

(setq dashboard-set-navigator t)
(setq dashboard-set-init-info t)
(setq dashboard-items '((recents  . 5)
                        (bookmarks . 5)
                        (projects . 5)
                        (agenda . 5)
                        (registers . 5)))


(use-package solarized-theme;
  :ensure t)
(use-package nord-theme
  :ensure t)
;;(load-theme 'solarized-light t)
(load-theme 'nord t)
(require 'restart-emacs)

(require 'spaceline-config)
(spaceline-spacemacs-theme)
(spaceline-compile
  ; left side
  '(((persp-name
      workspace-number
      window-number)
     :fallback evil-state
     :face highlight-face
     :priority 100)
    (anzu :priority 95)
    auto-compile
    ((buffer-modified buffer-size buffer-id remote-host)
     :priority 98)
    (major-mode :priority 79)
    (process :when active)
    ((flycheck-error flycheck-warning flycheck-info)
     :when active
     :priority 89)
    (minor-modes :when active
                 :priority 9)
    
    (erc-track :when active)
    (version-control :when active
                     :priority 78)
    (org-pomodoro :when active)
    (org-clock :when active)
    nyan-cat)
  ; right side
  '(which-function
    (python-pyvenv :fallback python-pyenv)
    (purpose :priority 94)
    (battery :when active)
    (selection-info :priority 95)
    input-method
    ((buffer-encoding-abbrev
      point-position
      line-column)
     :separator " | "
     :priority 96)
    (global :when active)
    (buffer-position :priority 99)
    (hud :priority 99)))


(add-to-list'load-path"~/.emacs.d/lisp/dired+.el")
(add-to-list'load-path"~/.emacs.d/lisp/ fakecygpty.el")
;; dashbord , spaceline,themes:1 ends here
